wolfSSL/wolfHAL/src/crypto/stm32wba_hash.c
const whal_Sha224Driver whal_Stm32wba_Hash_Sha224Driver = {
    .Oneshot = whal_Stm32wba_Sha224_Oneshot,
    .Start = whal_Stm32wba_Sha224_Start,
    .Process = whal_Stm32wba_Sha224_Process,
    .Finalize = whal_Stm32wba_Sha224_Finalize,
};


/* ---- SHA-256 ---- */

whal_Error whal_Stm32wba_Sha256_Oneshot(whal_Sha256 *dev,
                                        const void *in, size_t inSz,
                                        void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 32)
        return WHAL_EINVAL;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA256) | HASH_CR_INIT_Msk);

    if (inSz > 0) {
        if (!in)
            return WHAL_EINVAL;
        WriteTail(base, (const uint8_t *)in, inSz);
    }

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_Sha256_Start(whal_Sha256 *dev)
{
    size_t base = whal_Stm32wba_Hash_Dev.base;
    (void)dev;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA256) | HASH_CR_INIT_Msk);

    StreamReset();
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_Sha256_Process(whal_Sha256 *dev,
                                        const void *in, size_t inSz)
{
    (void)dev;
    if (inSz == 0)
        return WHAL_SUCCESS;
    if (!in)
        return WHAL_EINVAL;
    StreamWrite(whal_Stm32wba_Hash_Dev.base, (const uint8_t *)in, inSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_Sha256_Finalize(whal_Sha256 *dev,
                                         void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 32)
        return WHAL_EINVAL;

    StreamDrain(base);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

const whal_Sha256Driver whal_Stm32wba_Hash_Sha256Driver = {
    .Oneshot = whal_Stm32wba_Sha256_Oneshot,
    .Start = whal_Stm32wba_Sha256_Start,
    .Process = whal_Stm32wba_Sha256_Process,
    .Finalize = whal_Stm32wba_Sha256_Finalize,
};


/* ---- HMAC-SHA-1 ---- */

whal_Error whal_Stm32wba_HmacSha1_Oneshot(whal_HmacSha1 *dev,
                                          const void *key, size_t keySz,
                                          const void *in, size_t inSz,
                                          void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    size_t lkey;
    whal_Error err;
    (void)dev;

    if (!key || !digest || digestSz != 20)
        return WHAL_EINVAL;

    lkey = (keySz > 64) ? 1 : 0;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA1) |
                    whal_SetBits(HASH_CR_MODE_Msk, HASH_CR_MODE_Pos,
                                 HASH_MODE_HMAC) |
                    whal_SetBits(HASH_CR_LKEY_Msk, HASH_CR_LKEY_Pos, lkey) |
                    HASH_CR_INIT_Msk);

    /* Inner key */
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Message */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    if (inSz > 0) {
        if (!in)
            return WHAL_EINVAL;
        WriteTail(base, (const uint8_t *)in, inSz);
    }

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Outer key */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha1_Start(whal_HmacSha1 *dev,
                                         const void *key, size_t keySz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    size_t lkey;
    whal_Error err;
    (void)dev;

    if (!key)
        return WHAL_EINVAL;

    lkey = (keySz > 64) ? 1 : 0;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA1) |
                    whal_SetBits(HASH_CR_MODE_Msk, HASH_CR_MODE_Pos,
                                 HASH_MODE_HMAC) |
                    whal_SetBits(HASH_CR_LKEY_Msk, HASH_CR_LKEY_Pos, lkey) |
                    HASH_CR_INIT_Msk);

    /* Inner key */
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

