wolfSSL/wolfHAL/src/crypto/stm32wba_hash.c
    /* Store key for outer-key phase in Finalize */
    g_hmacSha1State.key = key;
    g_hmacSha1State.keySz = keySz;

    StreamReset();
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha1_Process(whal_HmacSha1 *dev,
                                           const void *in, size_t inSz)
{
    (void)dev;
    if (inSz == 0)
        return WHAL_SUCCESS;
    if (!in)
        return WHAL_EINVAL;
    StreamWrite(whal_Stm32wba_Hash_Dev.base, (const uint8_t *)in, inSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha1_Finalize(whal_HmacSha1 *dev,
                                            void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 20)
        return WHAL_EINVAL;

    /* Drain any buffered tail bytes, then DCAL to close message phase. */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    StreamDrain(base);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Outer key */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    WriteTail(base, (const uint8_t *)g_hmacSha1State.key, g_hmacSha1State.keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

const whal_HmacSha1Driver whal_Stm32wba_Hash_HmacSha1Driver = {
    .Oneshot = whal_Stm32wba_HmacSha1_Oneshot,
    .Start = whal_Stm32wba_HmacSha1_Start,
    .Process = whal_Stm32wba_HmacSha1_Process,
    .Finalize = whal_Stm32wba_HmacSha1_Finalize,
};


/* ---- HMAC-SHA-224 ---- */

whal_Error whal_Stm32wba_HmacSha224_Oneshot(whal_HmacSha224 *dev,
                                            const void *key, size_t keySz,
                                            const void *in, size_t inSz,
                                            void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    size_t lkey;
    whal_Error err;
    (void)dev;

    if (!key || !digest || digestSz != 28)
        return WHAL_EINVAL;

    lkey = (keySz > 64) ? 1 : 0;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA224) |
                    whal_SetBits(HASH_CR_MODE_Msk, HASH_CR_MODE_Pos,
                                 HASH_MODE_HMAC) |
                    whal_SetBits(HASH_CR_LKEY_Msk, HASH_CR_LKEY_Pos, lkey) |
                    HASH_CR_INIT_Msk);

    /* Inner key */
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Message */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    if (inSz > 0) {
        if (!in)
            return WHAL_EINVAL;
        WriteTail(base, (const uint8_t *)in, inSz);
    }

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Outer key */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha224_Start(whal_HmacSha224 *dev,
                                           const void *key, size_t keySz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    size_t lkey;
    whal_Error err;
    (void)dev;

    if (!key)
        return WHAL_EINVAL;

    lkey = (keySz > 64) ? 1 : 0;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA224) |
                    whal_SetBits(HASH_CR_MODE_Msk, HASH_CR_MODE_Pos,
                                 HASH_MODE_HMAC) |
                    whal_SetBits(HASH_CR_LKEY_Msk, HASH_CR_LKEY_Pos, lkey) |
                    HASH_CR_INIT_Msk);

    /* Inner key */
    WriteTail(base, (const uint8_t *)key, keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Store key for outer-key phase in Finalize */
    g_hmacSha224State.key = key;
    g_hmacSha224State.keySz = keySz;

    StreamReset();
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha224_Process(whal_HmacSha224 *dev,
                                             const void *in, size_t inSz)
{
    (void)dev;
    if (inSz == 0)
        return WHAL_SUCCESS;
    if (!in)
        return WHAL_EINVAL;
    StreamWrite(whal_Stm32wba_Hash_Dev.base, (const uint8_t *)in, inSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wba_HmacSha224_Finalize(whal_HmacSha224 *dev,
                                              void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 28)
        return WHAL_EINVAL;

    /* Drain any buffered tail bytes, then DCAL to close message phase. */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    StreamDrain(base);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    /* Outer key */
    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);
    WriteTail(base, (const uint8_t *)g_hmacSha224State.key, g_hmacSha224State.keySz);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

const whal_HmacSha224Driver whal_Stm32wba_Hash_HmacSha224Driver = {
    .Oneshot = whal_Stm32wba_HmacSha224_Oneshot,
    .Start = whal_Stm32wba_HmacSha224_Start,
    .Process = whal_Stm32wba_HmacSha224_Process,
    .Finalize = whal_Stm32wba_HmacSha224_Finalize,
};


/* ---- HMAC-SHA-256 ---- */

whal_Error whal_Stm32wba_HmacSha256_Oneshot(whal_HmacSha256 *dev,
                                            const void *key, size_t keySz,
                                            const void *in, size_t inSz,
                                            void *digest, size_t digestSz)
{
    const whal_Stm32wba_Hash_Cfg *cfg =
        (const whal_Stm32wba_Hash_Cfg *)whal_Stm32wba_Hash_Dev.cfg;
    size_t base = whal_Stm32wba_Hash_Dev.base;
    size_t lkey;
    whal_Error err;
    (void)dev;

    if (!key || !digest || digestSz != 32)
        return WHAL_EINVAL;

    lkey = (keySz > 64) ? 1 : 0;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

